#დავალება N4. შექმენით 2 ცვლადი, შეინახეთ მასში რიცხვები და საბოლოოდ დაბეჭდეთ ამ ორ ცვლადს შორის რომელიმე არითმეტიკული მოქმედება

#შევქმენი int. ტიპის ცვლადი. და მივანიჭე მნიშვნელობა 77.
number1=50
#შევქმენი int. ტიპის ცვლადი. და მივანიჭე მნიშვნელობა 99.
number2=20 
#ვბეჭდავ,  შეკრებას პირველ და მეორე ცვლადს შორის. შედეგი გამომაქვს ტერმინალში.
print(number1 + number2) 
#ვბეჭდავ, გამოკლებას პირველ და მეორე ცვლადს შორის. შედეგი გამომაქვს ტერმინალში.
print(number1 - number2) 
#ვბეჭდავ, გამრავლებას პირველ და მეორე ცვლადს შორის. შედეგი გამომაქვს ტერმინალში.
print(number1 * number2) 
#ვბეჭდავ, გაყოფას პირველ და მეორე ცვლადს შორის. შედეგი გამომაქვს ტერმინალში.
print(number1 / number2) 

