#ვასრულებ შედარებებს სადაც ვიყენებ > ნიშანს. შედეგი გამომაქვს ტერმინალში
print(50 > 20)
print(88 > 66)
print(20 > 55)
print(66 > 44)
print(55 > 33)


#and ოპერატორი(and ოპერატორზე იმისთვის რომ ტერმინალში მივიღოთ true გვჭირდება რომ ორივე შეყვანილი მაგალითი იყოს true)
print(55 >= 44 and 66 > 33)
print(66 > 11 and 44 >= 22)

#or ოპერატორზე(or ოპერატორზე მთავარია ერთ-ერთი მათგანი მაინც იყოს true შედეგად მივიღებთ true-ს)
print(66 > 44 or 44 < 33)
print(20 > 00 or 33 <= 11)

# ვიყენებ For Loop-ს
for i in range(1, 100, 5):
    print(i)

sum = 0
for num in range(1, 100):
    sum += num
print(sum)