function Knowme() {         //შევქმენით ფუნქცია სახელად Knowme და როდესაც ღილაკს დააჭერ მაშინ გააფრთხილოს სიტყვა "გაფრთხილებით" 
    alert("გაფრთხილება")
}

function name() {           //შევქმენით ფუნქცია სახელად name და მასში დავბეჭდე ჩემი სახელი, გვარი და გამოვიძახე
    console.log("Gabriel Jakhveladze")
}

name()

//ინდენტაცია - მარტივი დასანახი თვალით, მარტივი წასაკითხი, უფრო ლამაზი
//კომენტარები - ადამიანებისთვის მარტივი გზა რომ მიხვდეს რაზეა კოდი
//ფუნქციის მნიშვლელობის შესაბამისი სახელის შერჩევა - მარტივი მისახვედრია რა წერია ფუნქციაში
//external javascripti-ს გამოყენება - უფრო დიდი ადგილია და უფრო ცონფორტულია წერა
