#ვქმნი პროგრამას სადაც მომხმარებელი შემოიტანს 5 რიცხვს. და ვასრულებ ამ რიცხვებს შორის არითმეტიკულ ოპერაციებს. შედეგებს ვბეჭდავ ტერმინალში.
num1 = float(input("please enter first number : "))
num2 = int(input("please enter second number : "))
num3 = str(input("please enter third number : "))
num4 = int(input("please enter fourth number : "))
num5 = float(input("please enter  fifth number : "))

#ვასრულებ არითმეტიკულ მოქმედებს მომხმარებლის შემოტანილ რიცხცვებს შორის

#ათწილადს და მთელ რიცხვს შორის მოქმედებები შესრულება შესაძლებელია ამიტომ მივიღეთ შედეგი ტერმინალში
print(float(num1) + int(num2))
#მთელ რიცხვებს შორის მოქმედებების შესრულება შესაძლებელია ამიტომ შედეგები მივიღეთ ტერმინალში
print(int(num2) - int(num4))
#სტრინგის ტიპის მონაცმს და ათწილადს შორის შეუძლებელია მოქმედების შესრულება ამიტომ მივიღეთ ერორი      
print(str(num3) * float(num5))
#ათწილადს და მთელ რიცხვს შორის მოქმედებები შესრულება შესაძლებელია ამიტომ მივიღეთ შედეგი ტერმინალში
print(float(num5) / int(num2))
#ათწილადს და მთელ რიცხვს შორის მოქმედებები შესრულება შესაძლებელია ამიტომ მივიღეთ შედეგი ტერმინალში
print(int(num3) // float(num5))
#სტრინგის ტიპის მონაცმს და ათწილადს შორის შეუძლებელია მოქმედების შესრულება ამიტომ მივიღეთ ერორი  
print(float(num1) % str(num3))
#ათწილადს და მთელ რიცხვს შორის მოქმედებები შესრულება შესაძლებელია ამიტომ მივიღეთ შედეგი ტერმინალში
print(int(num2) + float(num5))
#ათწილადს და მთელ რიცხვს შორის მოქმედებები შესრულება შესაძლებელია ამიტომ მივიღეთ შედეგი ტერმინალში
print(float(num5) - int(num4))
#ორ ათწილადს შორის მოქმედებების შესრულება შესაძლებელია და შედეგს მივიღებთ ტერმინალში
print(float(num1) / float(num1))
#შეუძლებელია მთელი რიცხის სტრინგ ტიპის ფაილზე გაყოფა ამიტომ შედეგად ერორი მივიღეთ
print(int(num2) // str(num3))
#შეუძლებელია სტრინგის მთელ რიცხვზე გაყოფა ამიტომ შედეგად ერორი მივიღეთ
print(str(num3) % int(num2))